app/controllers/api/helpers/auth.rb

SELECT  "access_keys".* FROM "access_keys" WHERE "access_keys"."access_token" = $1 LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1
---
          def current_user
            # find token. Check if valid.
            params[:token] ||= request.headers['X-Api-Token']
            token = AccessKey.find_by_access_token( params[:token] )
            if token && !token.expired?
              token.update_expiry
              @current_user = User.find(token.user_id)