app/controllers/api/v1/agendas.rb

        desc 'Show all agenda items'
        paginate
        get do
          present Agenda.order('start_at desc').limit(10), with: AgendaEntity
---
SELECT  "agendas".* FROM "agendas"  ORDER BY start_at desc LIMIT 10