app/controllers/api/v1/auth.rb

          optional :expires_after, type: Integer, desc: 'How many days the token will be valid. Defaults to 1 day.'
        end
        post do
          user = User.find_by_email(params[:email])

          if user && user.valid_password?(params[:password])
            sign_in(user)
            key = AccessKey.create({user: user, expires_after: params[:expires_after]})
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1
INSERT INTO "access_keys" ("user_id", "access_token", "expires_after", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

          use :auth_params
        end
        delete do
          key = AccessKey.find_by_access_token( params[:token] )
---
SELECT  "access_keys".* FROM "access_keys" WHERE "access_keys"."access_token" = $1 LIMIT 1