app/controllers/api/v1/blogs.rb

        desc 'Show all blog items'
        paginate
        get do
          present Blog.order('created_at desc').limit(10), with: BlogEntity
---
SELECT  "blogs".* FROM "blogs"  ORDER BY created_at desc LIMIT 10