app/controllers/api/v1/default_texts.rb

          requires :page, type: String, desc: 'Which page does the text goes on?'
        end
        get do
          present DefaultText.where(page: params[:page]).limit(1).first, with: DefaultTextEntity
---
SELECT  "default_texts".* FROM "default_texts" WHERE "default_texts"."page" = $1  ORDER BY "default_texts"."id" ASC LIMIT 1