app/controllers/api/v1/rates.rb

        desc 'Show all rates'
        paginate
        get do
          present Rate.all, with: RateEntity
---
SELECT "rates".* FROM "rates"