app/controllers/api/v1/users.rb

SELECT  "users".* FROM "users" WHERE (NOT (content = '')) AND (user_type = 0) LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (NOT (content = '')) AND (user_type = 0)
---
        desc 'Show member profiles'
        paginate
        get 'leden' do
          present paginate(User.where.not("content = ?", "").where("user_type = ?", User.user_types[:lid])), with: UserProfileEntity

SELECT  "users".* FROM "users" WHERE (NOT (content = '')) AND (user_type = 1)  ORDER BY functie asc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (NOT (content = '')) AND (user_type = 1)
---
        desc 'Show member profiles'
        paginate
        get 'bestuur' do
          present paginate( User.where.not("content = ?", "").where("user_type = ?", User.user_types[:bestuur]).order('functie asc') ), with: UserProfileEntity

UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3
---
      end
      put do
        user_params = declared(params.except(:token), include_missing: false)
        error!(current_user.errors,422) unless current_user.update(user_params)