app/models/access_key.rb

UPDATE "access_keys" SET "expires_at" = '2016-03-27 12:53:44.944151' WHERE "access_keys"."id" = $1
---
  def update_expiry
    unless expires_after.nil?
      self.update_columns(expires_at: expires_after.days.since)

SELECT  "access_keys".* FROM "access_keys" WHERE "access_keys"."access_token" = $1 LIMIT 1
---
    def generate_access_token
      loop do
        token = SecureRandom.hex
        break token unless AccessKey.find_by_access_token(token)